-- ============================================
-- Дані для suppliers
-- ============================================

INSERT INTO suppliers (company_name, contact_person, phone, city) VALUES
('ТОВ ТехноСвіт', 'Іван Петренко', '+380671112233', 'Київ'),
('Smart Trade', 'Марія Коваленко', '+380931234567', 'Львів'),
('Global Electronics', 'Олег Бондар', '+380501112244', 'Одеса'),
('IT Supply', 'Анна Мельник', '+380661234111', 'Харків');

-- ============================================
-- Дані для products
-- ============================================

INSERT INTO products (product_name, category, price, quantity_in_stock) VALUES
('Ноутбук Lenovo', 'Компютери', 32000.00, 10),
('Мишка Logitech', 'Аксесуари', 850.00, 50),
('Клавіатура HyperX', 'Аксесуари', 2400.00, 20),
('Монітор Samsung', 'Монітори', 7800.00, 15),
('SSD Kingston 1TB', 'Накопичувачі', 3500.00, 30);

-- ============================================
-- Дані для deliveries
-- ============================================

INSERT INTO deliveries (supplier_id, product_id, delivery_date, quantity, total_price) VALUES
(1, 1, '2025-05-01', 5, 160000.00),
(2, 2, '2025-05-02', 20, 17000.00),
(2, 3, '2025-05-03', 10, 24000.00),
(3, 4, '2025-05-05', 7, 54600.00),
(4, 5, '2025-05-06', 12, 42000.00);